## Все запросы выполняются в MySQL

#### 1.1 Сформулируйте SQL запрос для создания таблицы book, занесите  его в окно кода (расположено ниже). Структура таблицы book:

In [ ]:
Create Table book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title Varchar(50),
    author Varchar(30),
    price Decimal(8, 2),
    amount Int
)

#### Занесите новую строку в таблицу book (текстовые значения (тип VARCHAR) заключать либо в двойные, либо в одинарные кавычки):

In [ ]:
INSERT INTO book (title, author, price, amount) 
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);

#### Занесите три последние записи в таблицу book

In [ ]:
INSERT INTO book (title, author, price, amount) 
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5);
INSERT INTO book (title, author, price, amount) 
VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10);
INSERT INTO book (title, author, price, amount) 
VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);
SELECT * FROM book;

#### Выбрать авторов, название книг и их цену из таблицы book.

In [ ]:
SELECT author, title, price 
FROM book;

#### Выбрать названия книг и авторов из таблицы book, для поля title задать новое имя Название, для поля author –  Автор.

In [ ]:
SELECT title AS Название, author as Автор
FROM book;

#### Для упаковки каждой книги требуется 1 лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать pack.

In [ ]:
SELECT title, amount, 
    1.65 * amount AS pack
FROM book;

#### В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.

In [ ]:
SELECT title, author, amount,
    ROUND(price-(price*0.3), 2) AS new_price 
FROM book

#### При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой.

In [ ]:
SELECT author, title,
    ROUND(IF(author = "Булгаков М.А.", price*1.1, IF(author = "Есенин С.А.", price*1.05, price)), 2) AS new_price
FROM book;